Ethancao123/ECE395/STM32/Final/Core/Inc/nrf.h
/*
 * nrf.h
 *
 *  Created on: May 1, 2025
 *      Author: ethancao
 */

#ifndef INC_NRF_H_
#define INC_NRF_H_

#define PAYLOAD_LEN 8
#define WIRELESS_ADDR 0x000000000B

/* nRF24L01+ Commands */
#define NRF24L01P_CMD_R_REGISTER                  0b00000000
#define NRF24L01P_CMD_W_REGISTER                  0b00100000
#define NRF24L01P_CMD_R_RX_PAYLOAD                0b01100001
#define NRF24L01P_CMD_W_TX_PAYLOAD                0b10100000
#define NRF24L01P_CMD_FLUSH_TX                    0b11100001
#define NRF24L01P_CMD_FLUSH_RX                    0b11100010
#define NRF24L01P_CMD_REUSE_TX_PL                 0b11100011
#define NRF24L01P_CMD_R_RX_PL_WID                 0b01100000
#define NRF24L01P_CMD_W_ACK_PAYLOAD               0b10101000
#define NRF24L01P_CMD_W_TX_PAYLOAD_NOACK          0b10110000
#define NRF24L01P_CMD_NOP                         0b11111111

/* nRF24L01+ Registers */
#define NRF24L01P_REG_CONFIG            0x00
#define NRF24L01P_REG_EN_AA             0x01
#define NRF24L01P_REG_EN_RXADDR         0x02
#define NRF24L01P_REG_SETUP_AW          0x03
#define NRF24L01P_REG_SETUP_RETR        0x04
#define NRF24L01P_REG_RF_CH             0x05
#define NRF24L01P_REG_RF_SETUP          0x06
#define NRF24L01P_REG_STATUS            0x07
#define NRF24L01P_REG_OBSERVE_TX        0x08    // Read-Only
#define NRF24L01P_REG_RPD               0x09    // Read-Only
#define NRF24L01P_REG_RX_ADDR_P0        0x0A
#define NRF24L01P_REG_RX_ADDR_P1        0x0B
#define NRF24L01P_REG_RX_ADDR_P2        0x0C
#define NRF24L01P_REG_RX_ADDR_P3        0x0D
#define NRF24L01P_REG_RX_ADDR_P4        0x0E
#define NRF24L01P_REG_RX_ADDR_P5        0x0F
#define NRF24L01P_REG_TX_ADDR           0x10
#define NRF24L01P_REG_RX_PW_P0          0x11
#define NRF24L01P_REG_RX_PW_P1          0x12
#define NRF24L01P_REG_RX_PW_P2          0x13
#define NRF24L01P_REG_RX_PW_P3          0x14
#define NRF24L01P_REG_RX_PW_P4          0x15
#define NRF24L01P_REG_RX_PW_P5          0x16
#define NRF24L01P_REG_FIFO_STATUS       0x17
#define NRF24L01P_REG_DYNPD             0x1C
#define NRF24L01P_REG_FEATURE           0x1D


#include <stdbool.h>
#include "stm32g4xx_hal.h"

class Nrf {
public:
	Nrf(SPI_HandleTypeDef* bus_, bool isTX_, GPIO_TypeDef *_csnPort,
			uint16_t _csnPin, GPIO_TypeDef *_cePort, uint16_t _cePin);
	uint8_t tx(uint8_t* payload);
	uint8_t rx(uint8_t* payload);
	uint8_t status();
	uint8_t reset();
private:
	uint8_t read_register(uint8_t reg);
	uint8_t write_register(uint8_t reg, uint8_t value);
	void setCS(bool state);
	void setCE(bool state);
	SPI_HandleTypeDef* bus;
	bool isTX;
	GPIO_TypeDef *csnPort;
	uint16_t csnPin;
	GPIO_TypeDef *cePort;
	uint16_t cePin;
};



#endif /* INC_NRF_H_ */
